public class Weiyi{

	public static void main(String[] args){


		// << 左位移相当于  乘以2的N次方，举例： A << B  == A *（2的B次方）  
		// >> 右位移相当于  除以2的N次	

		System.out.println(10<<2);  // 0000 1010 向左移2位  0010 1000  =  40 
		System.out.println(10>>3);  // 1
			

		// >>> 无符号右移，注意（没有无符号左移）

		// -5   == 1111 1111 1111 1111 1111 1111 1111 1011     536870911
		System.out.println(-5>>3);   //右移3位 用1补位 1111 1111 1111 1111 1111 1111 1111 1111 就是等于-1
		System.out.println(-5>>>3);  //右移3位 用0补位 0001 1111 1111 1111 1111 1111 1111 1111 就是等于536870911

		//(第一位0为正数，第一位1为负数)


	}

}
